app/controllers/clients_controller.rb

  def create
    @client = Client.where(client_ic).first
---
SELECT  "clients".* FROM "clients" WHERE "clients"."ic" = $1 ORDER BY "clients"."id" ASC LIMIT $2  [["ic", "10756159"], ["LIMIT", 1]]

  def pup
    @client = Client.first
---
SELECT  "clients".* FROM "clients" ORDER BY "clients"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def load_client
    @client = Client.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]